.open attendance.db

DROP TABLE IF EXISTS students;
DROP TABLE IF EXISTS progress;
DROP TABLE IF EXISTS labs;
DROP TABLE IF EXISTS attendance;

PRAGMA foreign_keys=ON;

CREATE TABLE labs (id INTEGER NOT NULL PRIMARY KEY, number TEXT NOT NULL, max_ball Integer NOT NULL, dead_line TEXT NOT NULL, group INTEGER NOT NULL);
CREATE TABLE students (id INTEGER NOT NULL PRIMARY KEY, surname TEXT NOT NULL, initials TEXT, group INTEGER NOT NULL, variant INTEGER DEFAULT null);
CREATE TABLE attendance (id INTEGER NOT NULL PRIMARY KEY, student_id INTEGER NOT NULL, date TEXT NOT NULL,
                          FOREIGN KEY (student_id) references student(id) on delete cascade);
CREATE TABLE progress (id INTEGER NOT NULL PRIMARY KEY, student_id INTEGER NOT NULL, lab_id INTEGER NOT NULL, date TEXT NOT NULL, ball INTEGER Not NULL,
                          FOREIGN KEY (student_id) references student(id) on delete cascade,
						  FOREIGN KEY (lab_id) references labs(id) on delete cascade);

 
INSERT INTO students(id, surname, initials, group, variant)
values
(1, "Александров", "К.В.", 402, 1),
(2, "Антонов", "К.Ю.", 402,	1),
(3 ,"Арянов", "В.А.", 402,1),
(4, "Ахунзада", "Г.А"., 402,1),
(5, "Балашов", "В.В"., 402,1),
(6, "Бикмаев", "Р.Р.", 402,1),
(7 ,"Булатова", "Г.Р"., 402,2),
(8, "Гераськин", "В.М.", 402,2),
(9 ,"Гурьков", "Н.Д.", 402,2),
(10, "Дурнаев", "Н.С.", 402,2),
(11, "Егоров", "О.А.", 402,2),
(12, "Кокулов", "А.Ф.", 402,3),
(13, "Кудашкин", "А.Е"., 402,3),
(14, "Лихорадов", "И.И.", 402,3),
(15, "Логинов", "А.Д"., 402,3),
(16, "Ломайкин", "А.С"., 402,3),
(17, "Макушев", "В.А.", 402,4),
(18, "Макшев", "Н.И.", 402,4),
(19, "Матвеев", "М.Д."	, 402,4),
(20, "Парамонов", "О.Н.", 402,4),
(21, "Плаксин", "Д.В.", 402,5),
(22, "Сазонов", "А.В.", 402,5),
(23, "Седики", "Х.Ю.", 402,5),
(24, "Сюсин", "А.В.", 402,5),
(25, "Тростин", "С.А.", 402,5),
(26, "Шабарин", "И.А.", 402,5);

INSERT INTO students(id, surname, initials, group)
values(27,"Алексеев", "Алексей",303),	
(28,"Ашрятова", "Римма",303),			
(29,"Борисов", "Александр",303),
(30,"Гарин", "Максим",303),			
(31,"Головатюк", "Анастасия",303),					
(32,"Горбунов", "Андрей",303),					
(33,"Гуськов", "Артем",303),						
(34,"Дворянинова", "Дарья",303),					
(35,"Еделева", "Юлия",303),				
(36,"Зевайкин", "Андрей",303),				
(37,"Исоков", "Асадбек",303),				
(38,"Казакова", "Ирина",303),				
(39,"Квашнин", "Кирилл"	,303),			
(40,"Кирдюшкин", "Данила",303),					
(41,"Козина", "Светлана",303),					
(42,"Козлова", "Екатерина",303	),			
(43,"Котков","Сергей"	,303),				
(44,"Ландышев", "Александр",303),	
(45,"Логинов", "Виталий",303),	
(46,"Малов", "Кирилл",303),				
(47,"Манин", "Данила",303),				
(48,"Маслова", "Елена",303),					
(49,"Паршин", "Артем",303	),			
(50,"Пузин", "Владислав",303),				
(51,"Сайфетдинов", "Салават",303),					
(52,"Симатов", "Вадим",303);

INSERT INTO labs(id, number , max_ball, dead_line , group)
values
(1,"1",5,"06.02.2021",303),
(2,"2",5,"20.02.2021",303),
(3,"3",5,"27.02.2021",303),
(4,"4",6,"13.03.2021",303),
(5,"5",6,"27.03.2021",303),
(6,"6",8,"10.04.2021",303),
(7,"7",8,"24.04.2021",303),
(8,"к/р",6,"17.04.2021",303),
(9,"8",6,"01.05.2021",303),
(10,"9",8,"22.05.2021",303),
(11,"10",7,"05.06.2021",303),
(12,"1",8,"06.02.2021",402),
(13,"2",8,"13.02.2021",402),
(14,"3",9,"27.02.2021",402),
(15,"4",12,"13.03.2021",402),
(16,"5",12,"27.03.2021",402),
(17,"6",12,"10.04.2021",402),
(18,"7",9,"17.04.2021",402);





























